{
    "nav-about": "About",
    "nav-experience": "Experience",
    "nav-skills": "Skills",
    "nav-projects": "Projects",
    "nav-education": "Education",
    "nav-interests": "Interests",
    "intro": "Hi! I’m Anson, a software engineer passionate about Computer Vision (CV), 3D scanning, reconstruction, and mobile app development. With years of experience in the industry, I have not only honed my technical expertise but also mastered the ability to transform complex data into intuitive visual representations. I remain dedicated to advancing my skills in these fields, consistently striving for excellence and accumulating impactful results along the way. I invite you to explore my portfolio and see how my expertise can bring ideas to life.",
    "location": "New Taipei City, Taiwan",
    "experience-title": "Experience",
    "experience-position-1": "Senior Computer Vision Engineer",
    "experience-role-title-1": "Technical Research and Project Management",
    "experience-detail-1-1": "Led the development of the company’s proprietary 3D content social app, integrating ARFoundation (ARKit) with Unity’s 3D rendering capabilities, using C# for development. The project also involved communication with AWS, including user account registration, login and logout functionality, as well as uploading and downloading 3D files to and from mobile devices. The final outcome successfully attracted significant investments from multiple investors.",
    "experience-detail-1-2": "Collaborated with the U.S. team on multi-camera 3D modeling algorithms, referencing techniques like KinectFusion and DynamicFusion, utilizing tools such as OpenCV and Open3D for deep learning and modeling.",
    "experience-detail-1-3": "Successfully brought the 3D modeling workflow to market and collaborated with a well-known Taiwanese quiz show to achieve interactive effects between 3D volumetric characters and live scenes, demonstrating the application of the technology in the entertainment industry.",
    "experience-detail-1-4": "Worked with U.S. clients to develop a football training detection system, handling soccer detection, multi-camera calibration, and training app development. The system, utilizing Open3D and calibration techniques, was successfully deployed in large sports venues for multiple teams.",
    "experience-detail-1-5": "Participated in a remote physical therapy project that allows users to perform therapy sessions at home using remote camera setups. The system captures 2D color and depth information and reconstructs a 3D static model of the user’s body. It then uses deep learning models to analyze whether the user’s posture has improved after therapy, providing personalized rehabilitation suggestions. I was responsible for integrating the research and processes developed by the technical team, using Docker to incorporate them into the CI/CD pipeline, and successfully collaborating with the Server Team to deploy the 3D processing workflow on AWS, with the processed results returned to the client side. This architecture ensures system stability and scalability, enabling automated deployment and real-time data processing.",
    "experience-role-title-2": "Technical Development and Tool Building",
    "experience-detail-2-1": "Generated large volumes of 3D volumetric videos and displayed them in Unity-based mobile applications, applied across industries like sports, social media, and television. The development primarily involved C++, Python, and Unity.",
    "experience-detail-2-2": "Collaborated with the art team to establish a 3D modeling workflow, developing multiple tool scripts in Blender using Python and the Blender API to enhance detail processing and reduce production time.",
    "experience-detail-2-3": "Developed several 3D scanning applications using Swift, primarily focused on scanning people. The goal was to allow users to easily capture and record objects with their mobile phones. The apps utilized ARKit and referenced several Apple-provided scanning projects. The development focused on enabling real-time processing on mobile devices, quickly generating watertight 3D models that could be previewed in either AR or 3D object modes.",
    "experience-role-title-3": "Team Management and Collaboration",
    "experience-detail-3-1": "Led a small team in client servicing and collaborated with partner engineering teams to ensure smooth project execution, utilizing Git for version control and project management.",
    "experience-detail-3-2": "Participated in team expansion and recruitment efforts, eventually managing an engineering team of 5 to 10 people, responsible for technical training and project coordination.",
    "experience-duration-1": "December 2016 - July 2024",
    "experience-position-2": "Senior Game Programmer",
    "experience-company-2": "XPEC Entertainment, Inc",
    "experience-project-1-title": "FINAL FANTASY XV POCKET EDITION",
    "experience-project-1-detail-1": "Developed tools for game designers to easily define trigger zones and logic within the game, such as setting up trap areas or defining the conditions for entering specific zones, allowing designers to quickly implement their ideas.",
    "experience-project-1-detail-2": "Built an audio management system based on Wwise, enabling sound designers to efficiently define and configure triggers for ambient sounds, background music (BGM), and other audio elements, making the setup process more intuitive and user-friendly.",
    "experience-project-1-detail-3": "Participated in the development and testing of various features, focusing on performance optimization to ensure smooth operation across multiple platforms.",
    "experience-project-1-detail-4": "Collaborated closely with game designers and artists to align development processes, plan schedules, and ensure timely project delivery.",
    "experience-role-title-4": "Unity Support Team (R&D Team) - C#, Unity",
    "experience-project-2-detail-1": "Conducted research into enemy AI and behavior systems for the 3D action game team, focusing on features such as following, patrolling, and guarding mechanics.",
    "experience-project-2-detail-2": "Researched and developed tools aimed at reducing development time and improving overall game quality.",
    "experience-project-2-detail-3": "Investigated and developed a unified audio system for all game projects built with Unity, ensuring consistency and efficiency across different teams.",
    "experience-project-2-detail-4": "Rapidly developed multiple prototypes for action and RPG games, demonstrating key gameplay mechanics and concepts within short timeframes.",
    "experience-duration-2": "April 2015 - October 2016",
    "experience-position-3": "Game Programmer",
    "experience-company-3": "XPEC Entertainment, Inc",
    "experience-project-3-title": "DTL(Web Game)",
    "experience-project-3-detail-1": "Designed the UI/UX for the game, focusing on creating an intuitive and engaging user experience.",
    "experience-project-3-detail-2": "Developed the core gameplay mechanics, implementing features that align with the game’s design and objectives.",
    "experience-project-3-detail-3": "Successfully published the game, overseeing the entire development process from concept to release.",
    "experience-duration-3": "October 2013 - March 2015",
    
    "skills-title": "Skills",
    "skills-programming": "Programming Languages & Tools",
    "skills-workflow": "Workflow",
    "workflow-mobile": "Mobile-First, Responsive Design",
    "workflow-testing": "Cross Platform Testing & Debugging",
    "workflow-teams": "Cross Functional Teams",
    "workflow-version": "Version Control with Git & GitHub",
    "workflow-optimization": "Performance Optimization",
    "skills-libraries-cv": "Libraries (CV/ML/AI)",
    "skills-libraries-3d": "Libraries (3D)",
    "skills-libraries-ar": "Libraries (AR/VR)",
    "skills-sensors": "RGBD Sensors",
   
    "projects-title": "Projects",
    "industry-project": "Industry Project",
    "project-3dcapturing-title": "3DCapturing App",
    "project-3dcapturing-description": "This project is a 3D capturing app that also includes 3D reconstruction features, initially developed to attract potential customers. I was fully responsible for the UI/UX design, as well as the development of the entire app. Users begin by registering or logging in and providing necessary personal information. After this, they proceed to the 3D capturing stage, where the app captures multiple angles of the user, which are then used to reconstruct a 3D object for analysis. The app also includes features for reviewing the generated 3D object and provides an onboarding page to guide users through the app. Additionally, the app offers a function that allows users to capture real-world objects by simply circling them, enabling 3D reconstruction directly on the mobile device.",
    "project-3dshare-title": "3DShare App",
    "project-3dshare-description": "This project was an app that I was fully responsible for developing at my previous company. Due to the need to display extensive 3D content, effects, and real-time computations, Unity was chosen as the development platform. The app features significant UI and UX design elements, along with various social media and social functionalities, such as sharing 3D content or screenshots. Additionally, the app includes the capability to download the latest 3D holograms from the server in real-time and display them directly within the app, offering a rich interactive experience.",
    "project-3dshowcases-title": "3D showcases",
    "project-3dshowcases-description": "These applications were developed with the aim of collaborating with potential clients, utilizing 3D visualization to replace traditional 2D display methods. The projects span industries such as sports, energy, and smart environments. Compared to 2D, 3D technology offers a more visual and comprehensive presentation of data and information. Additionally, these applications integrate 3D models with real-world terrain and statistical data, creating a more dynamic and interconnected visualization experience. I consolidated the results of these projects into a single showcase, utilizing various technologies such as UI/UX design, human-computer interaction, light and shadow switching, point cloud rendering, and a simulation system for crowd detection and statistics.",
    "project-visionfusion-title": "Vision Fusion",
    "project-visionfusion-description": "This project showcases my work in areas such as object detection, posture recognition, object classification, and the application of these technologies in services such as physical therapy and posture recognition. In these projects, I utilized a variety of tools and libraries, including Microsoft’s Azure Kinect Body Tracking SDK, OpenPose, MediaPipe, and extensive use of OpenCV libraries. For object detection, I employed YOLO (You Only Look Once) technology. These projects highlight the practical applications of these advanced technologies in real-world scenarios.",
    "project-arcollective-title": "AR Collective",
    "project-arcollective-description": "This project involved compiling and integrating videos of various AR demos I have worked on over the years into a comprehensive showcase, highlighting the evolution and application of AR technology. In these demos, object recognition technology progressed from traditional marker recognition, to image recognition, to 3D object recognition, and now the latest method using ARKit for spatial positioning. Most of the development was carried out on the Unity platform, utilizing AR Foundation, ARKit, and Vuforia. By consolidating these demo videos, I can systematically showcase how these AR technologies have been applied across different scenarios, emphasizing the diversity of the technology and its developmental journey.",
    "project-motionviz-title": "Motion Viz",
    "project-motionviz-description": "This project involved developing a visualization pipeline and toolset in Unity, specifically designed to showcase motion capture and posture analysis techniques. The tool provides an intuitive way to display detailed information for each marked point within 3D holograms, including coordinates and velocity. These marked points represent key nodes in the motion, allowing for in-depth analysis and evaluation of the movements. The tool not only accurately presents the dynamic changes of these points but also helps users better understand complex motions and postures.",
    "project-futurecity-title": "Future City AR",
    "project-futurecity-description": "This project is an AR 3D object tracking app running on Android, developed using Unity. In the project, one mobile device serves as the server side to control the 3D content and synchronizes the control results to the client-side mobile device. The controls include displaying digital content and locking onto interactive objects. The virtual 3D content is positioned by tracking real-world 3D objects, enabling a seamless integration between the virtual and real environments.",
    "project-flowtracking-title": "Realtime Flow Tracking",
    "project-flowtracking-description": "This project focuses on real-time people tracking and crowd monitoring using LiDAR technology. LiDAR sensors are installed at key street entrances to detect and track pedestrian flow for crowd control. The system is integrated with a Unity-based interface, providing a user-friendly way to monitor crowd density and visualize 3D crowd movement. The data is continuously sent to AWS for statistical analysis to help manage crowd flow effectively. During the pandemic, this system proved particularly useful for controlling the number of people entering and exiting the area and issuing alerts when necessary. The project also received the Global ICT Excellence Award.",
    "weekend-project": "Weekend Project",
    "project-TagandTrack-title": "“Record Your Love” — Your Personal Collection Buddy",
    "project-TagandTrack-description": "Simply scan a barcode with your iPhone and instantly add the item to your collection list.Whether it’s books, toys, limited-edition figures, wine, music albums, or even your favorite food list — you can organize, categorize, and add personal notes with ease.Built-in search helps you quickly find what you’re looking for, and you can even generate a QR code to share your collection with friends.With its clean and intuitive design, managing your treasures is effortless — no more duplicate purchases or forgotten items hiding in the corner.",
    "project-flagMaster-title": "Flag Master",
    "project-flagMaster-description": "This flag quiz app blends education and entertainment, designed to help players learn and recognize flags from around the world. Built with Unity, the app supports both Chinese and English languages and offers five game modes, including Endless Challenge, Timed Mode, and Review Mode, catering to diverse preferences. On the technical side, it uses JSON to manage flag data, LeanTween for smooth UI animations and visual effects, and includes features like accuracy tracking and a personalized stats page to help players focus on improvement.The design emphasizes simplicity and intuitiveness, enhanced by dynamic button animations and sound feedback for an engaging experience. Future updates will introduce interactive map integration and additional game modes, further enriching the gameplay and providing a fun way to explore world flags.",
    "project-financeapp-title": "Finance app (tentative)",
    "project-financeapp-description": "I’m currently working on a project that allows users to simply input a stock ticker symbol and retrieve relevant stock information, including real-time prices, transaction volumes, price changes, opening prices, and KD values. The goal is to eventually integrate custom algorithms to filter out preferred stocks. The project is being developed in Python and runs on macOS.",
    "project-blinkybox-title": "Blinky Box",
    "project-blinkybox-description": "Because my child loves playing with light switches, I created a handheld toy that allows them to toggle different types of switches to individually control various light bulbs, satisfying their curiosity and desire to explore.",
    "project-safeeats-title": "Safe Eats",
    "project-safeeats-description": "To help my pregnant wife quickly check which foods are not recommended during pregnancy, I developed a lightweight 2D app using Unity. The app allows for quick food safety checks, adding new food information to a personalized list, and indicating whether a food is safe to eat through an intuitive signal light.",
    "project-trashcan-title": "Automated Sensor Trash Can",
    "project-trashcan-description": "In my spare time, I designed and built an automated sensor trash can that opens when a user approaches. This project involved prototyping with Arduino, integrating sensors, and designing a compact mechanism. The trash can provides a touchless experience and is both practical and fun to use.",
    "academic-project": "Academic Project",
    "project-fishanalysis-title": "Research on fish posture analysis and water quality monitoring",
    "project-fishanalysis-description": "This project was developed in collaboration with the water treatment plant to assess water quality by analyzing fish posture. Water from the source is introduced into two separate tanks, each containing a goldfish (Carassius auratus) that has adapted to the water conditions. Cameras are positioned at the front and side of each tank to monitor the fish. The system leverages background removal and dynamic object elimination to establish a clean background, combined with morphological processing to accurately capture the fish’s body region. An SVM model is then used to classify and recognize the fish’s orientation, enabling real-time statistical analysis and water quality assessment. If both tanks show signs of abnormal fish behavior, the system automatically sends a text message to notify maintenance personnel. The entire project was developed in C++, with multi-threading used to accelerate dual-channel video processing, and MFC employed for interface development.",
    "project-freeview3d-title": "FreeView 3D",
    "project-freeview3d-description": "This project is an autostereoscopic 3D display system that dynamically adjusts the displayed 3D content based on the user’s head position. The system first utilizes OpenCV for real-time face and head position detection, accurately capturing the user’s viewing angle. Bullet Physics SDK is then employed to simulate the physical behavior of objects in the scene, including realistic effects like gravity and collisions. Finally, OpenGL is used to render the corresponding 3D scene based on the detected viewing angle, ensuring a smooth and immersive 3D experience from different perspectives. The system delivers a glasses-free 3D display, making it ideal for interactive showcases and exhibitions.",
    "project-peoplecounting-title": "People Counting",
    "project-peoplecounting-description": "This is an academic project focused on people counting using computer vision techniques. The system is equipped with a top-view camera that continuously monitors and tracks people flow in real time. The project uses OpenCV for background modeling and foreground detection, allowing the system to isolate moving targets. Morphological processing techniques are applied to accurately extract human contours for effective counting. To present the results intuitively, an interface was developed using MFC, which displays real-time counting results and processed images. This system is ideal for environments requiring crowd analytics, such as public transport stations, commercial spaces, or event venues, providing accurate and timely data support.",
    "project-digitalrecognition-title": "Digital Recognition",
    "project-digitalrecognition-description": "This project is a digit recognition system developed using MATLAB. It provides a handwriting interface where users can directly write the numbers they want to recognize. The system utilizes SVM (Support Vector Machine) for classification and integrates PCA for dimensionality reduction, ensuring high recognition accuracy while reducing data complexity. Through this process, the system effectively handles variations in handwritten inputs and quickly identifies the numbers, showcasing the application of machine learning in image recognition.",

    "education-title": "Education",
    "education-university": "National Dong Hwa University",
    "education-degree": "Master's degree",
    "education-major": "Computer Science & Information Engineering",
    "phi-tau-phi": "(The honor member of Phi Tau Phi Scholastic Honor Society)",
    "education-gpa": "GPA: 4.33",
    "publications-title": "Publications",
    "publication-title-1": "Analysis and comparison of fish posture by image processing",
    "publication-conference-1": "Published in: International Conference on Machine Learning and Cybernetics, 2010",
    "publication-link-1": "Read Paper",
    "publication-title-2": "Virtual Multiple-Perspective Display Using Pyramidal or Conical Showcase",
    "publication-conference-2": "Published in: ICS, 2013",
    "publication-link-2": "Read Paper",
    "education-duration-3": "August 2011 - May 2013",

    "interests-title": "Interests",
    "interests-paragraph-1": "In my free time, I love reading, watching movies, and catching up on TV series—they help me unwind and enjoy some quiet moments. Outdoors, I enjoy cycling and hiking, taking in the scenery, and snapping a few photos along the way. These activities keep me balanced and make life more enjoyable.",
    "interests-paragraph-2": "Besides reading and outdoor activities, I enjoy getting hands-on with fun DIY projects. I once made a simple automatic sensor trash can that opens when you approach it—really handy! I also created some interactive toys for my son, like a light that he can control with his hands. He loves playing with them. These little projects add some fun to my busy days and give my son some cool toys to enjoy.",
    "interests-paragraph-3": "I enjoy capturing life’s moments with my camera, whether it’s the warmth of everyday scenes or a beautiful view I stumble upon during a trip. Photography, for me, is a way to freeze those touching moments and appreciate the little things in life.",
    "interests-image-alt": "Photography",

    "watch-video" : "Watch Video",
    "view-project-on-GitHub" : "View Project on GitHub",
    "read-news" : "Read News",
    "read-paper": "Read Paper"
}